<html>
<head>
    <style>
        h3 {
            position: absolute;
            top: 45%;
        }
    </style>
</head>
<body>
<h3>
    Произошла ошибка
</h3>
<h2>
    Для продолжения действий на странице необходимо учесть следующие правила:
</h2>
<ul>
    <li>
        Максимальное количество символов в названии новости: 128 символов
    </li>
    <li>
        Максимальный объем текста в новости: 1024 символа
    </li>
    <li>
        Максимальное количество новостей: 255 новостей
    </li>
</ul>
</body>
</html>
