<html>
<head>
</head>
<body>
<div align="center">
    <h1>
        Произошла ошибка
    </h1>
</div>
<h2>
    Для продолжения действий на странице необходимо учесть следующие правила:
</h2>
<ul>
    <li>
        Максимальное количество символов в названии новости: 128 символов
    </li>
    <li>
        Максимальный объем текста в новости: 1024 символа
    </li>
    <li>
        Максимальное количество новостей: 255 новостей
    </li>
</ul>
<a href="{{url()->previous()}}">
    <button>Вернуться обратно</button>
</a>
</body>
</html>
