<template>
  <div id="ngs">Народная премия NGS.RU</div>
  <div id="all_news">
    <h3>Все новости</h3>
    <hr>
    <div v-for="novelty in news">
      <span>{{ novelty.name }}</span>
      <hr>
    </div>
  </div>
  <div v-for="item in news" id="news">
    <h2>{{ item.name }}</h2>
    <br>
    <img v-if="item.photo" v-bind:src=item.photo>
    <br>
    <span>{{ item.text }}</span>
  </div>
</template>

<script>
export default {
  name: "VueNews",
  data() {
    return {
      news: [
        {
          photo: 'images/sw.jpg',
          name: 'Власти Швейцарии связали дефицит лекарств с конфликтом на Украине',
          text: 'Перебои с поставками лекарств в Швейцарии выросли на 46% в период с 2021 по 2022 год, отчасти причиной этого является конфликт на Украине, говорится в опубликованном докладе минэкономики Швейцарии. В прошлом году бюро уведомлений зафиксировало 201 нарушение поставок, что стало новым рекордом. Это на 46% больше, чем в 2021 году (137 нарушений), и почти на 10% больше, чем в 2019 году (184). Более чем в половине случаев нарушения, наблюдавшиеся в 2022 году, были связаны с антибиотиками (35%) или обезболивающими (19%), - сказано в документе, опубликованном на сайте Федерального совета.'
        },
        {
          photo: 'images/2d2618c20d17f3e1921ec0d98f0e45.png',
          name: 'Выбраться с МЖК: власти три года обещают построить новую дорогу на Доватора — спасет ли она от пробок',
          text: 'Октябрьский район — второй по численности населения в Новосибирске. Из-за большого количества автомобилей, а зимой — еще и из-за гор снега, там часто собираются пробки, а в общественном транспорте сложно найти место. Но ситуацию хотят исправить, как минимум для жителей МЖК и Плющихинского жилмассива — власти уже несколько лет обещают начать строить новую дорогу на улице Доватора. Она должна пройти от улицы Татьяны Снежиной до Гусинобродского шоссе. НГС выяснил, где собираются проложить дорогу, во сколько она обойдется бюджету и когда автомобилисты смогут по ней ездить.'
        },
        {
          photo: 'images/kakoe-morozhenoe-mozhno-est-esli-vy-na-diete_1656418757679199039.jpg',
          name: 'Лето начинается с мороженого: где искать любимые эскимо, стаканчики и рожки',
          text: 'Летом мороженого хочется практически каждый день: эскимо на прогулке, рожок после обеда и большой брикет для семейных вечеров. Не только вкусно, но и освежающе — для многих новосибирцев вкус лета складывается из любимого лакомства, свежих овощей и фруктов.'
        },
        {
          photo: 'images/nissan-z-proto-lateral.jpg',
          name: 'В Новосибирске начали предлагать новые японские спорткары за 9 миллионов — как они выглядят и сколько ждать машину',
          text: 'Новосибирцам стали доступны для покупки японские спорткары — объявления публикуют новосибирские автодилеры, а везут авто через третьи страны несколько месяцев. Корреспондент НГС пообщался с продавцами и автоэкспертами и выяснил, откуда везут машины, во сколько они обойдутся и есть ли на такой сегмент спрос у сибиряков.'
        }
      ],
    }
  }
}
</script>

<style scoped>
#ngs {
  background-color: midnightblue;
  width: 100%;
  height: 50px;
  color: greenyellow;
  text-align: center;
  font-size: 24px;
  font-family: sans-serif;
}

#all_news {
  width: 230px;
  position: absolute;
  left: 15%;
  font-family: sans-serif;
}

#news {
  border: solid 2px;
  margin-top: 15px;
  margin-left: 30%;
  padding: 10px;
  width: 700px;
  font-size: 18px;
  font-family: sans-serif;
}

img {
  width: 700px;
  height: 400px;
}
</style>